# Pandas

![](http://pandas.pydata.org/_static/pandas_logo.png)
[Pandas](http://pandas.pydata.org/) is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. Pandas is free software released under the three-clause BSD license. The name is derived from the term _panel data_, an econometrics term for multidimensional structured data sets.

#### Contents
* [Importing Pandas](#Importing-Pandas) and other libraries.
* [Creating Data](#Creating-Data) using lists and tuples
* [Viewing Data](#Viewing-Data)
* [Saving Data](#Saving-Data) to_csv and to_excel
* [Loading Data](#Loading-Data) read_csv, read_table read_excel, read_html
    * [Unix and os](#Unix-and-os)
    * [csvs and Excel](#CSVs-and-Excel)
* [Selecting Data](#Selecting-Data) loc,iloc,isin
    * [Masks](#Masks) or boolean arrays


NB: This notebook misses some methods of joining and concatenating and merging data. The instances in which those are useful are quite specific, so we'll see some examples but won't have a section in this notebook for reference. 

#### Resources:  
* [Pandas Documentation](http://pandas.pydata.org/pandas-docs/stable/index.html), especially
[10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)  
* [The Data Incubator](https://www.thedataincubator.com/)  
* [Hernan Rojas' learn-pandas](https://bitbucket.org/hrojas/learn-pandas)  
* [Harvard CS109 lab1 content](https://github.com/cs109/2015lab1)

## Importing Pandas

The general way to import libraries is to write
```python
import library #import the library directly
import library as alias 

# This just aliases the package names.
# That way we can call methods like plt.plot() instead of matplotlib.pyplot.plot().

from library import function # import specific functions or types in a library
%jupyter magic # jupyter only functions
```

In [1]:
# Some imports - for style reasons, try and put in alphabetical order, unless there are subgroupings of imports
# that you want.
import matplotlib #we'll only use this to determine the matplotlib version number
import matplotlib.pyplot as plt  # the graphing library
import numpy as np # scientific computing library
import pandas as pd # the data structure and analysis library
from pandas import DataFrame, read_csv, Series # specific functions from pandas
import seaborn as sns # Makes graphs look pretty
import sys #we'll only use this to determine the python version number

# Enable inline plotting.  The % is an iPython thing, and is not part of the Python language.
# In this case we're just telling the plotting library to draw things on
# the notebook, instead of on a separate window.
%matplotlib inline

In [2]:
# All the imports are listed as modules, including pyplot.  But there are several other types
%whos

Variable     Type        Data/Info
----------------------------------
DataFrame    type        <class 'pandas.core.frame.DataFrame'>
Series       type        <class 'pandas.core.series.Series'>
matplotlib   module      <module 'matplotlib' from<...>matplotlib\\__init__.py'>
np           module      <module 'numpy' from 'c:\<...>ges\\numpy\\__init__.py'>
pd           module      <module 'pandas' from 'c:<...>es\\pandas\\__init__.py'>
plt          module      <module 'matplotlib.pyplo<...>\\matplotlib\\pyplot.py'>
read_csv     function    <function read_csv at 0x000001FE9E985090>
sns          module      <module 'seaborn' from 'c<...>s\\seaborn\\__init__.py'>
sys          module      <module 'sys' (built-in)>

In [3]:
# How to check your version numbers
print(('Python version: ' + sys.version))
print() 
print(('Pandas version: ' + pd.__version__))
print(('Matplotlib version: ' + matplotlib.__version__))

Python version: 3.10.11 (tags/v3.10.11:7d4cc5a, Apr  5 2023, 00:38:17) [MSC v.1929 64 bit (AMD64)]

Pandas version: 2.0.0
Matplotlib version: 3.7.1

## Creating Data

There are many ways to input data into Pandas. The goal of this is to input data to DataFrames.

In [4]:
# A data frame, using a dictionary with ordered 
# lists for columns

df1 = pd.DataFrame({
    'number': [1, 2, 3],
    'animal': ['cat', 'dog', 'mouse']
})

# The same data frame, using tuples for each row
# We need to give the column names separately!
df2 = pd.DataFrame([
    ('cat', 1),
    ('dog', 2),
    ('mouse', 3),
], columns=['animal', 'number'])

# Are they the same?
assert((df1 == df2).all().all)

df1

ValueError: Can only compare identically-labeled (both index and columns) DataFrame objects

In [5]:
dates = pd.date_range('20161101',periods =6)
dates

DatetimeIndex(['2016-11-01', '2016-11-02', '2016-11-03', '2016-11-04',
               '2016-11-05', '2016-11-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df3 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df3

                   A         B         C         D
2016-11-01 -0.412550  0.663693 -0.560607  0.013330
2016-11-02 -0.922448 -0.864225 -1.950773 -0.830660
2016-11-03 -0.265539  0.047527 -0.924802  0.500518
2016-11-04  0.520553 -0.097209 -1.360097 -0.070913
2016-11-05 -1.781908  0.028056  0.047514  0.039998
2016-11-06  1.464755  0.561589  0.943324  0.678826

Let's Create another DataFrame, with different data types.  
Side note that that you can copy examples from the internet 
like this into Jupyter Notebooks, it still works, but only if there isn't anything else in the cell!

From: http://pandas.pydata.org/pandas-docs/stable/10min.html

In [7]:
In [10]: df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
   ....: 

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
# Dataframe Columns have specific data types
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

Selecting a single column, which yields a Series.

A Series, like a numpy array, most be of homogenous type

In [9]:
# Like Dictionaries! DataFrame is a dictionary of Series!
df1['animal']

0      cat
1      dog
2    mouse
Name: animal, dtype: object

In [10]:
# Access a column as a property of df1
df1.animal

0      cat
1      dog
2    mouse
Name: animal, dtype: object

In [11]:
# Selecting rows
df3[3:5]

                   A         B         C         D
2016-11-04  0.520553 -0.097209 -1.360097 -0.070913
2016-11-05 -1.781908  0.028056  0.047514  0.039998

## Exercise

In [12]:
# Select all the data from columns of C and D of df3
df3.iloc[:, 2:4]

                   C         D
2016-11-01 -0.560607  0.013330
2016-11-02 -1.950773 -0.830660
2016-11-03 -0.924802  0.500518
2016-11-04 -1.360097 -0.070913
2016-11-05  0.047514  0.039998
2016-11-06  0.943324  0.678826

## Saving Data

#### Exporting to CSVs and Excel files

Export the our df to a ***csv*** file. We can name the file ***malaysia_states.csv***, but we can also do a txt file! The function ***to_csv*** will be used to export the file. The file will be saved in the same location of the notebook unless specified otherwise.

In [13]:
states = ['Johor','Kedah','Kelantan','Melaka', 
          'Negeri Sembilan','Pahang','Perak','Perlis',
          'Penang','Sabah', 'Sarawak','Selangor','Terengganu']
area = [19210,9500,15099,1664,6686,36137,21035,
        821,1048,73631,124450,8104,13035]
state_area = list(zip(states, area))
state_area
df = pd.DataFrame(data = state_area, columns=['State', 'Area'])

In [14]:
df.to_csv?

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

The only parameters we will use is ***index*** and ***header***. Setting these parameters to True will prevent the index and header names from being exported. Change the values of these parameters to get a better understanding of their use.

In [15]:
df.to_csv('malaysia_states.csv',index=False,header=False)

In [16]:
# Let's also try a text file
# CSV actually stands for comma separated values.
df.to_csv('malaysia_states.txt',index=False,header=False)

In [ ]:
df.to_excel?

In [ ]:
# And to Excel files
df.to_excel('malaysia_states.xlsx',index=False)

In [ ]:
# Reset our namespace; delete all variables
%reset

In [ ]:
%whos

## Loading Data

Let's now try accessing that csv that we just saved.  Let us take a look at this function and what inputs it takes.

In [ ]:
pd.read_csv?

Even though this functions has many parameters, we will simply pass it the location of the text file. We know that we saved things into the same directory.

### CSVs and Excel

In [17]:
path = 'malaysia_states.csv'
df = pd.read_csv(path)
df

              Johor   19210
0             Kedah    9500
1          Kelantan   15099
2            Melaka    1664
3   Negeri Sembilan    6686
4            Pahang   36137
5             Perak   21035
6            Perlis     821
7            Penang    1048
8             Sabah   73631
9           Sarawak  124450
10         Selangor    8104
11       Terengganu   13035

The read_csv function treated the first record in the csv file as the header names. This is obviously not correct since the text file did not provide us with header names.
To correct this we will pass the header parameter to the read_csv function and set it to None (means null in python).

In [18]:
df = pd.read_csv(path, header=None)
df

                  0       1
0             Johor   19210
1             Kedah    9500
2          Kelantan   15099
3            Melaka    1664
4   Negeri Sembilan    6686
5            Pahang   36137
6             Perak   21035
7            Perlis     821
8            Penang    1048
9             Sabah   73631
10          Sarawak  124450
11         Selangor    8104
12       Terengganu   13035

If we wanted to give the columns specific names, we would have to pass another paramter called names. We can also omit the header parameter.

In [19]:
area_df = pd.read_csv(path, names=['State','Area'])
area_df

              State    Area
0             Johor   19210
1             Kedah    9500
2          Kelantan   15099
3            Melaka    1664
4   Negeri Sembilan    6686
5            Pahang   36137
6             Perak   21035
7            Perlis     821
8            Penang    1048
9             Sabah   73631
10          Sarawak  124450
11         Selangor    8104
12       Terengganu   13035

You can think of the numbers [0,1,2,3,4] as the row numbers in an Excel file. In pandas these are part of the ***index*** of the dataframe. You can think of the index as the primary key of a sql table with the exception that an index is allowed to have duplicates.  

***[State, Area]*** can be thought of as column headers similar to the ones found in an Excel spreadsheet or sql database.

> Delete the csv file now that we are done using it.

In [ ]:
# Using a Python Library - you can also use the unix command directly!
import os
os.remove(path)

In [ ]:
# Note that we do the same with xls files, only use read_excel.
# Try it!
pd.read_excel?

## Selecting Data

We can select data both by their labels and by their position.

In [20]:
dates = pd.date_range('20160101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print(dates)
df

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2016-01-01 -1.731517  1.285297  2.269570 -0.337098
2016-01-02  0.190687 -0.745524 -0.387909  0.924922
2016-01-03  0.831496  0.876176  0.484160  1.183648
2016-01-04  0.172395  0.324784 -0.586129 -1.575199
2016-01-05 -0.525719 -1.078668  0.982500  0.666557
2016-01-06 -1.702613  0.457365 -0.605659 -1.964969

In [21]:
# Try head, tail, index, columns, values, describe, T, sort_index
# sort_values and see for yourself what they do!
# df.head()
# df.tail()
# df.index
df.values

array([[-1.73151731,  1.2852966 ,  2.26957001, -0.33709762],
       [ 0.19068669, -0.74552367, -0.3879088 ,  0.92492194],
       [ 0.83149583,  0.87617597,  0.48415981,  1.18364819],
       [ 0.1723949 ,  0.32478413, -0.58612915, -1.5751993 ],
       [-0.52571871, -1.07866832,  0.98250033,  0.66655678],
       [-1.70261286,  0.45736517, -0.60565856, -1.96496947]])

In [22]:
# Getting a cross section on a label
# print((dates[0]))
print((df.loc[dates[0]]))

A   -1.731517
B    1.285297
C    2.269570
D   -0.337098
Name: 2016-01-01 00:00:00, dtype: float64

In [23]:
# Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2016-01-01 -1.731517  1.285297
2016-01-02  0.190687 -0.745524
2016-01-03  0.831496  0.876176
2016-01-04  0.172395  0.324784
2016-01-05 -0.525719 -1.078668
2016-01-06 -1.702613  0.457365

In [24]:
# Showing label slicing, both endpoints are included 
# unlike normal slicing

df.loc['20160103':'20160105',['B','C']]

                   B         C
2016-01-03  0.876176  0.484160
2016-01-04  0.324784 -0.586129
2016-01-05 -1.078668  0.982500

In [25]:
# To get a scalar value... both work!
df.loc[dates[2],'D']
# df.at[dates[2],'D']

1.1836481937321344

In [26]:
df.at[dates[2],'D']

1.1836481937321344

```iloc``` is the same as ```loc```, only it works by position, not by label.

In [27]:
# Select via the position of the passed integers
df.iloc[2,3]

1.1836481937321344

In [28]:
# By integer slices, acting similar to numpy/python
df.iloc[3:5,0:2]

                   A         B
2016-01-04  0.172395  0.324784
2016-01-05 -0.525719 -1.078668

In [29]:
# By lists of integer position locations, 
# similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2016-01-02  0.190687 -0.387909
2016-01-03  0.831496  0.484160
2016-01-05 -0.525719  0.982500

In [30]:
# iloc is used to slice rows and columns explicitly

df.iloc[1:3,:]

                   A         B         C         D
2016-01-02  0.190687 -0.745524 -0.387909  0.924922
2016-01-03  0.831496  0.876176  0.484160  1.183648

In [31]:
df.iloc[:,1:3]

                   B         C
2016-01-01  1.285297  2.269570
2016-01-02 -0.745524 -0.387909
2016-01-03  0.876176  0.484160
2016-01-04  0.324784 -0.586129
2016-01-05 -1.078668  0.982500
2016-01-06  0.457365 -0.605659

In [32]:
# For getting a value explicitly
df.iloc[1,1]
# df.iat[1,1]

-0.7455236747563819

## Exercise

In [33]:
# retrieve the value of Column C on 2016-01-05
dates = pd.date_range('20160101', periods=6)
df_c = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df_c.loc['2016-01-05', 'C']

1.169400240243167

In [34]:
# sort the states by area in descending order
path = 'malaysia_states.csv'
df_states = pd.read_csv(path, names=['State', 'Area'])
df_states.sort_values(by='Area', ascending=False)

              State    Area
10          Sarawak  124450
9             Sabah   73631
5            Pahang   36137
6             Perak   21035
0             Johor   19210
2          Kelantan   15099
12       Terengganu   13035
1             Kedah    9500
11         Selangor    8104
4   Negeri Sembilan    6686
3            Melaka    1664
8            Penang    1048
7            Perlis     821

In [35]:
# which is the smallest state?
df_min = df_states['Area'].min()
df_min_idx = df_states['Area'].idxmin()
df_min_states = df_states.loc[df_min_idx-1, 'State']
df_min_states

'Perak'

### Masks

We can use _boolean arrays_ to select data

In [36]:
df_new = df_c.copy()
df_new.A>0

2016-01-01     True
2016-01-02     True
2016-01-03     True
2016-01-04    False
2016-01-05    False
2016-01-06     True
Freq: D, Name: A, dtype: bool

In [37]:
df_new[df_new.A > 0]

                   A         B         C         D
2016-01-01  0.753877  0.889638 -0.951853 -1.511349
2016-01-02  0.106168  1.010509 -0.942424  0.501953
2016-01-03  0.973300 -0.447585 -1.183967  0.255617
2016-01-06  0.376569 -0.441715  0.654749  0.328901

In [38]:
df_new > 0

                A      B      C      D
2016-01-01   True   True  False  False
2016-01-02   True   True  False   True
2016-01-03   True  False  False   True
2016-01-04  False  False  False   True
2016-01-05  False  False   True  False
2016-01-06   True  False   True   True

In [39]:
df_new[df_new > 0]

                   A         B         C         D
2016-01-01  0.753877  0.889638       NaN       NaN
2016-01-02  0.106168  1.010509       NaN  0.501953
2016-01-03  0.973300       NaN       NaN  0.255617
2016-01-04       NaN       NaN       NaN  0.339996
2016-01-05       NaN       NaN  1.169400       NaN
2016-01-06  0.376569       NaN  0.654749  0.328901

### Setting Data

In [40]:
df2 = df_new.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2016-01-01  0.753877  0.889638 -0.951853 -1.511349    one
2016-01-02  0.106168  1.010509 -0.942424  0.501953    one
2016-01-03  0.973300 -0.447585 -1.183967  0.255617    two
2016-01-04 -0.196078 -0.190138 -0.797450  0.339996  three
2016-01-05 -2.216608 -0.181850  1.169400 -1.258451   four
2016-01-06  0.376569 -0.441715  0.654749  0.328901  three

In [41]:
df2['E'].isin(['two','four'])

2016-01-01    False
2016-01-02    False
2016-01-03     True
2016-01-04    False
2016-01-05     True
2016-01-06    False
Freq: D, Name: E, dtype: bool

In [42]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2016-01-03  0.973300 -0.447585 -1.183967  0.255617   two
2016-01-05 -2.216608 -0.181850  1.169400 -1.258451  four

In [43]:
# We can set data in a variety of ways
print(df2)
df2.at[dates[0],'A'] = 0
df2.iat[0,1] = 0
df2.loc[:,'D'] = np.array([5] * len(df2))
df2

                   A         B         C         D      E
2016-01-01  0.753877  0.889638 -0.951853 -1.511349    one
2016-01-02  0.106168  1.010509 -0.942424  0.501953    one
2016-01-03  0.973300 -0.447585 -1.183967  0.255617    two
2016-01-04 -0.196078 -0.190138 -0.797450  0.339996  three
2016-01-05 -2.216608 -0.181850  1.169400 -1.258451   four
2016-01-06  0.376569 -0.441715  0.654749  0.328901  three

                   A         B         C    D      E
2016-01-01  0.000000  0.000000 -0.951853  5.0    one
2016-01-02  0.106168  1.010509 -0.942424  5.0    one
2016-01-03  0.973300 -0.447585 -1.183967  5.0    two
2016-01-04 -0.196078 -0.190138 -0.797450  5.0  three
2016-01-05 -2.216608 -0.181850  1.169400  5.0   four
2016-01-06  0.376569 -0.441715  0.654749  5.0  three

## Exercise

In [44]:
# Rename the column E to 'values'
dff = df2.copy()
dff = dff.rename(columns={'E': 'values'})
dff

                   A         B         C    D values
2016-01-01  0.000000  0.000000 -0.951853  5.0    one
2016-01-02  0.106168  1.010509 -0.942424  5.0    one
2016-01-03  0.973300 -0.447585 -1.183967  5.0    two
2016-01-04 -0.196078 -0.190138 -0.797450  5.0  three
2016-01-05 -2.216608 -0.181850  1.169400  5.0   four
2016-01-06  0.376569 -0.441715  0.654749  5.0  three

In [45]:
# Add another new column to df (name of the column is 'total')
dff['total'] = ''
dff

                   A         B         C    D values total
2016-01-01  0.000000  0.000000 -0.951853  5.0    one
2016-01-02  0.106168  1.010509 -0.942424  5.0    one
2016-01-03  0.973300 -0.447585 -1.183967  5.0    two
2016-01-04 -0.196078 -0.190138 -0.797450  5.0  three
2016-01-05 -2.216608 -0.181850  1.169400  5.0   four
2016-01-06  0.376569 -0.441715  0.654749  5.0  three

In [46]:
# Add the values of A, B and C and state the total values in 'total' column
dff['total'] = dff['A']+dff['B']+dff['C']
dff

                   A         B         C    D values     total
2016-01-01  0.000000  0.000000 -0.951853  5.0    one -0.951853
2016-01-02  0.106168  1.010509 -0.942424  5.0    one  0.174253
2016-01-03  0.973300 -0.447585 -1.183967  5.0    two -0.658252
2016-01-04 -0.196078 -0.190138 -0.797450  5.0  three -1.183667
2016-01-05 -2.216608 -0.181850  1.169400  5.0   four -1.229058
2016-01-06  0.376569 -0.441715  0.654749  5.0  three  0.589603

In [49]:
# Export the data in df to a csv file.
dff.to_csv('dff.csv')